Revit 2027 API
BoundaryConditions.RemoveHostConstraint Method
 Removes constraint from host for this boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveHostConstraint()
Public Sub RemoveHostConstraint
public:
void RemoveHostConstraint()
member RemoveHostConstraint : unit -> unit
Exceptions
Exception | Condition
ModificationForbiddenException |  Boundary condition is a BoundaryConditionsType::Area and the host is an Analytical Panel with curved profile.
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace